% % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % 
% Logistic1.docx例子解答：
% （1）确定pi和P之间的映射关系，例子评测结果里面有10个0,10个1，数量相等，可以取分界值0.5，即：
%                                                                               pi<=0.5,P = 0;   
%                                                                               pi> 0.5,P = 1;
%  (2)对于20家企业，只知道评估结果P（即0和1），没法做多元线性回归，即已知x1,x2,x3,但是不知道y(这里pi就相当与y,因为pi是对应的概率函数),所以
%     为了方便计算，干脆取两个区间的中间值，即（0+0.5）/2和（0.5+1）/2,所以列表里面的Y等于0的全部换为0.25，全部为1的换为0.75
%     
%     到此y值便确定了，即0.25和0.75的组合。
% 
% matlab实现（利用多元线性回归）：
% (1)输入：
%         x1（1*n）矩阵存储x1坐标
%         x2（1*n）矩阵存储x2坐标
%         ......
%         y1（1*n）矩阵存储y坐标
%         y2（1*n）矩阵存储y2坐标
%         ......
% (2)输出：
%         [b,bint,r,rint,s]=regress(Y,X,alpha);里面的所有参数，回归系数b构成多元回归模型
%         残差图分析
%         相关系数b
%         验证的所以数据的0或1
% 
% 
% 重点：如果出现错误;"错误使用 horzcat串联的矩阵的维度不一致"可能是X,Y那里的行矩阵和列矩阵的转化出现问题
% % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % %

% 数据的存储
x1 = [-62.8 3.3 -120.8 -18.1 -3.8 -61.2 -20.3 -194.5 20.8 -106.1 43 47 -3.3 35 46.7 20.8 33 26.1 68.6 37.3];
x2 = [-89.5 -3.5 -103.2 -28.8 -50.6 -56.2 -17.4 -25.8 -4.3 -22.9 16.4 16 4 20.8 12.6 12.5 23.6 10.4 13.8 33.4];
x3 = [1.7 1.1 2.5 1.1 0.9 1.7 1 0.5 1 1.5 1.3 1.9 2.7 1.9 0.9 2.4 1.5 2.1 1.6 3.5 ];
y = [0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.75 0.75 0.75 0.75 0.75 0.75 0.75 0.75 0.75 0.75];

% 绘制散点图
% subplot(1,3,1);plot(x1,y,'g*');
% subplot(1,3,2);plot(x2,y,'k+');
% subplot(1,3,3);plot(x3,y,'ro');

% 数据的长度
n=length(x1); 

% X,Y制作
X=[ones(n,1),x1',x2',x3'];
Y = y';

% 注意matlab的log是数学上的ln
Y = log(Y./(1-Y));


% 线性分析
[b,bint,r,rint,s]=regress(Y,X,0.05);
% b,bint,r,rint,s

% 残差分析
% rcoplot(r,rint);

% % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % % %
% 求解完系数后代入要预测的数值
% 模型的验证和应用
x11 = [-62.8 3.3 -120.8 -18.1 -3.8 -61.2 -20.3 -194.5 20.8 -106.1 43 47 -3.3 35 46.7 20.8 33 26.1 68.6 37.3 -49.2 -19.2 40.6 34.6 19.9];
x22 = [-89.5 -3.5 -103.2 -28.8 -50.6 -56.2 -17.4 -25.8 -4.3 -22.9 16.4 16 4 20.8 12.6 12.5 23.6 10.4 13.8 33.4 -17.2 -36.7 5.8 26.4 26.7];
x33 = [1.7 1.1 2.5 1.1 0.9 1.7 1 0.5 1 1.5 1.3 1.9 2.7 1.9 0.9 2.4 1.5 2.1 1.6 3.5 0.3 0.8 1.8 1.8 2.3];
n = length(x11);
p = zeros(1,n);


for i = 1:length(x11)
   Pai0 = exp(b(1,1) + b(2,1)*x11(1,i) +b(3,1)*x22(1,i) + b(4,1)*x33(1,i))/(1+exp(b(1,1) + b(2,1)*x11(1,i) +b(3,1)*x22(1,i) + b(4,1)*x33(1,i)));
   if(Pai0<=0.5)
       p(1,i) = 0;
   else
      p(1,i) = 1; 
   end
end
b'
p

