%--------------------------------------------------------------------------
%  第4.5章  线性方程组求解
%-------------------------------------------------------------------------- 

%对于线性方程组Ax=b，可以利用左除运算符反斜杠求解，b左除以A可获得线性方程组的数值解x。

%{
    /（向右倒称为右除）                    右除                AB=C    A=C/B
    \（向左倒称为左除）                    左除                AB=C    B=A\C
    x = A\b 表示使用 mldivide 获得的矩阵方程 Ax = b 的解。
    A=[1 2 3; 4 5 6]; 则matlab 中 A' = [1 4 ;2 5;3 6],  "A'"表示转置
    其中‘;’表示换行,这和线性代数上的转置是完全一样的道理,就是行变列,列变行.
%}


%线性方程组直接解算法  
% A1x=b1 X2A1=b2
A1 = [1,2,3;4,5,6;7,8,0];
b1 = [14;32;23];
b2 = [30 36 15];
b3 = [30;36;15];

x1 = A1\b1
x2 = b2/A1
x3 = A1\b3
%线性方程组迭代解算法  

%雅可比（Jacobi）迭代法
%{
    A: 线性方程组的系数矩阵（n*n，非奇异）
    b: 方程组右边的常数项列向量
    n: 方程组维数
    x0: 初始值向量
    eps: 精度上限值
    M:  最大迭代次数

    exp:
   
%}

A2 = [8,3,-1;1,-5,3;0,-2,7];
b4 = [6,4,3]';%表示列向量 
x01 = [0,0,0]';%表示列向量
eps1 = 1e-6;
x4 = Jacobi(A2,b4,x01,eps1,80)

%{
    A: 线性方程组的系数矩阵（n*n，非奇异）
    b: 方程组右边的常数项列向量
    n: 方程组维数
    x0: 初始值向量
    tol: 精度上限值
    nmax:  最大迭代次数
    //迭代终止标准
    已达精度上限值或者到达最大迭代次数
    //输出量：
    x：线性方程组的解
%}

%高斯-赛德尔（Gauss-Seidel）解线性方程组的Matlab实现

A3 = [9,2,2,-4;2,8,2,-3;2,2,7,2;3,2,-2,9];
b5 = [1,-1,2,1]';%表示列向量 
x02 = [0,0,0,1]';%表示列向量
eps2 = 1e-6;
tol2 = 1e-6;
x5 = Gauss_Seidel_fun(A3,b5,x02,80,tol2)



%sor迭代法求解线性方程组
%  求线性方程组的sor(successive over-relaxation)迭代法，调用格式为
    %  [x, n] = sor(A,b,x,w,it_max)
    %  其中, A 为线性方程组的系数矩阵，w为权重值(修正参数)，b 为常数项
    %  tol 预定进度
    %  x0: 初始值向量
    %  x 为线性方程组的解，n-1为迭代次数

A4 = [5,2,-1,3;-2,8,-1,-3;1,-1,5,2;-1,-2,-1,9];
b6 = [-2,10,6,18]';%表示列向量 
x03 = [1,1,1,1]';%表示列向量
w = 1.1;%w为权重值(修正参数)
tol3 = 1e-7;
[x6,k] = SOR(A4,b6,x03,w,tol3)