%--------------------------------------------------------------------------
%  第1章  MATLAB简介
%--------------------------------------------------------------------------
% 1.数值变量 实数 复数
% 对于复数的运算函数
% real() 提取复数中的实部
% imag() 提取复数中的虚部
% complex() 产生复数
% demo
% A =  3.0000 + 4.0000i
% a =   3
% b =  4
%--------------------------------------------------------------------------

A = complex(3, 4)
a = real(A)
b = imag(A)
%--------------------------------------------------------------------------
% 2.内存管理函数
% clear a: 清除变量a
% clear all: 清除全部的变量
% clear : 清除所有能清楚的变量
% complex() 产生复数
% demo
%`arr=[1,2,3,4,5,6,7,8,9,10]; %分号;用于数组的分隔，和不进行计算的结果的命令
% arrleng = 10
% clc 命令清空屏幕
% clf 命令清空图像
%--------------------------------------------------------------------------

arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
arrleng = length(arr)

onsa = ones(10)
size(onsa)
% clear 清除变量命令 结果
%{
    》clear
    》a
    函数或变量 'a' 无法识别。
    》b
    函数或变量 'b' 无法识别。
    》A
    函数或变量 'A' 无法识别。
    》arr
    函数或变量 'arr' 无法识别。
    》arrleng
    函数或变量 'arrleng' 无法识别。
    》onsa
    函数或变量 'onsa' 无法识别。
 
%}
%--------------------------------------------------------------------------
% 3.绘制图像
%    绘制图像 clf清除图形  figure 创建新的图像窗口
%   plot(X,Y) 创建 Y 中数据对 X 中对应值的二维线图。
%   要绘制由线段连接的一组坐标，请将 X 和 Y 指定为相同长度的向量。
%   要在同一组坐标轴上绘制多组坐标，请将 X 或 Y 中的至少一个指定为矩阵
%   subplot(m, n, p) m行n列(lie) p表示图像序号
%--------------------------------------------------------------------------

x = 0:0.1:2*pi;
plot(x,sin(x)) 

% 多图绘制 
x_y  =  0:0.1:2*pi;
y_x  =  0:0.1:2*pi;
subplot(2, 1, 1) % 2行1列 第一个图像

plot(x_y,sin(x_y)) 
subplot(2, 1, 2)  % 2行1列 第一个图像
plot(y_x,cos(y_x)) 


%--------------------------------------------------------------------------
% 4.特殊矩阵
%    1. 稀疏矩阵 sparse(S)
%    2. 魔方矩阵 magic(n)
%    3. 范德蒙德矩阵 vander(a) 
%    4. 希尔伯特矩阵 hilb(n)  逆矩阵 invhilb(n) 
%    
%--------------------------------------------------------------------------
%    1. 稀疏矩阵 sparse(S)
Aa3 = [1,2,3,0,0;11,4,6,0,0;7,8,9,1,1];
S1= sparse(Aa3)  %去掉零元素，只剩下非0元素
%{
    S =

   (1,1)        1
   (2,1)       11
   (3,1)        7
   (1,2)        2
   (2,2)        4
   (3,2)        8
   (1,3)        3
   (2,3)        6
   (3,3)        9
   (3,4)        1
   (3,5)        1
    %}
%    2. 魔方矩阵 magic(n)
S2 = magic(8)
%    3. 范德蒙德矩阵 vander(a) 
Aa3 = [1,2,3,4,5];
S3 = vander(Aa3)
%    4. 希尔伯特矩阵 hilb(n)  逆矩阵 invhilb(n) 
S4 = hilb(4)
S5 = invhilb(4)


%{
 S2 =

    64     2     3    61    60     6     7    57
     9    55    54    12    13    51    50    16
    17    47    46    20    21    43    42    24
    40    26    27    37    36    30    31    33
    32    34    35    29    28    38    39    25
    41    23    22    44    45    19    18    48
    49    15    14    52    53    11    10    56
     8    58    59     5     4    62    63     1


S3 =

     1     1     1     1     1
    16     8     4     2     1
    81    27     9     3     1
   256    64    16     4     1
   625   125    25     5     1


S4 =

    1.0000    0.5000    0.3333    0.2500
    0.5000    0.3333    0.2500    0.2000
    0.3333    0.2500    0.2000    0.1667
    0.2500    0.2000    0.1667    0.1429


S5 =

          16        -120         240        -140
        -120        1200       -2700        1680
         240       -2700        6480       -4200
        -140        1680       -4200        2800   
%}