%--------------------------------------------------------------------------
%  第2.2章 向量 矩阵
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%   向量的创建
%--------------------------------------------------------------------------
%  行向量 Row vector
row = [9,8,7,6,5]
%  列向量 Column vector
column = [9;8;7;6;5]  % ";"表示1行结束
%{
row =
     9     8     7     6     5
column =
     9
     8
     7
     6
     5
%}
% 使用“:” 生成(行)向量内容
% a1=J:K   生成(行)向量内容 a1=[J,J+1,J+2,....K]
% a2=J:D:K 生成(行)向量内容 a2=[J,J+D,J+2*D,....J+m*D]  m=fix((K-J)/D) J,K表示范围 D表示间距大小
a1=2:10 
a2=0:2:20
%{
a1 =

     2     3     4     5     6     7     8     9    10
a2 =

     0     2     4     6     8    10    12    14    16    18    20
%} 
%--------------------------------------------------------------------------
%   等差向量
% x1 = linspace(x1, x2)     在(x1,x2)之间生成100个线性分布的数据 构成等差向量
% x1 = linspace(x1, x2,n)   在(x1,x2)之间生成n个线性分布的数据   构成等差向量
x1 = linspace(1, 100) 
x2 = linspace(1, 100,5) 
x3 = linspace(1, 20,5)  % 1.0000    5.7500   10.5000   15.2500   20.0000
%--------------------------------------------------------------------------
%{
x1 =
  列 1 至 27
     1     2     3     4     5     6     7     8     9    10    11    12    13    14    15    16    17    18    19    20    21    22    23    24    25    26    27
  列 28 至 54
    28    29    30    31    32    33    34    35    36    37    38    39    40    41    42    43    44    45    46    47    48    49    50    51    52    53    54
  列 55 至 81
    55    56    57    58    59    60    61    62    63    64    65    66    67    68    69    70    71    72    73    74    75    76    77    78    79    80    81
  列 82 至 100
    82    83    84    85    86    87    88    89    90    91    92    93    94    95    96    97    98    99   100
x2 =
    1.0000   25.7500   50.5000   75.2500  100.0000
%}
%--------------------------------------------------------------------------
%   等比向量 logspace()
%   logx1 = logspace(a, b)    在(a,b)之间生成50个线性分布的数据 构成等比向量  x(1)=10^a x(50)=10^b
%   logx2 = logspace(a, b,n)  在(a,b)之间生成n个线性分布的数据 构成等比向量   x(1)=10^a x(n)=10^b
%--------------------------------------------------------------------------
logx1 = logspace(2, 64)       %   1.0e+257 *
logx2 = logspace(2, 1024,5)   %   0.0000    3.1623       Inf       Inf       Inf
%--------------------------------------------------------------------------
%   向量的拆分
%--------------------------------------------------------------------------

% 使用“[]” 抽取向量内容
A1=[1,2,3,5,6,8];
B1=A1([1 3 5])   % [1 3 5]表示提取第1，3，5个元素

% 使用“ 抽取向量” 抽取其他的向量内容
% 抽取向量 a=[1 3 5] [1 3 5]表示提取第1，3，5个元素
a=[1 3 5];
A2=[4,2,3,6,9,8];
B2=A2(a)
% 使用“:” 抽取向量内容
A3=[1,2,3,5,6,8];
B3=A3(1:2:6)  

%(1:2:6)  表示在1~6范围内，每隔2进行取数
%(m:d:n)  表示在m~n范围内，每隔d进行取数(d步长,间距大小)


%--------------------------------------------------------------------------
%   矩阵的创建
%矩阵 元素必须在[]内,矩阵同行元素之间使用空格或者“,”分隔  矩阵不同行之间使用“;”分隔 
%矩阵元素可以是数值，变量，表达式，或者函数，矩阵的大小尺寸不必预先设置
%--------------------------------------------------------------------------
%1.直接输入创建矩阵
arr1 = [22,4,5;55,77,99]
%{
arr1 =
    22     4     5  
    55    77    99
%}

%2.利用MATLAB函数创建矩阵
% ones()  产生全为1的矩阵
% zeros() 产生全为0的矩阵
% eye()   产生单位阵

A4 = ones(3)    %ones(n)  产生nxn维全1矩阵
A5 = ones(3,4)  %ones(m,n)  产生mxn维全1矩阵

Z4 = zeros(3)    %zeros(n)  产生nxn维全0矩阵
Z5 = zeros(3,4)  %zeros(m,n)  产生mxn维全0矩阵

E4 = eye(3)    %eye(n)  产生nxn维单位阵
E5 = eye(2,4)  %eye(m,n)  产生mxn维单位阵

% rand()  产生在(0,1)区间的均匀分布发随机阵

R4 = rand(4)     % rand(m)   产生nxn维在(0,1)区间的均匀分布随机阵 
R5 = rand(4,5)   % rand(m,n) 产生mxn维在(0,1)区间的均匀分布随机阵 
% Rx = rand(1,2,3,4)   % rand(m,n,j,k...) 产生mxnxjxk....维在(0,1)区间的均匀分布随机阵 
Ra = rand(size(A1))  % rand(size(A)) 产生一个和A有相同维数大小的在(0,1)区间的均匀分布随机阵 
% 产生一个mxn维在(-t,t) 区间的均匀分布随机阵 Y = t- 10*rand(m,n)
% 产生一个mxn维在(-t,t) 区间的均匀分布随机整数阵 Y = t- round(10*rand(m,n))
% 产生一个mxn维在(-t,t) 区间的均匀分布随机阵,矩阵元素精确到10^(-2) Y = t- round(10*rand(m,n))/100
% 产生一个mxn维在(-t,t) 区间的均匀分布随机阵,矩阵元素精确到10^(-x) Y = t- round(10*rand(m,n))/(10^x)


% randn() 产生均值为0,方差为1的标准正态分布随机阵
Y4 = randn(4)
Y5 = randn(2,3)
Ya = randn(size(A1))

% randn(n) 产生均值为0,方差为1的标准正态分布 nxn维 随机阵
% randn(m,n) 产生均值为0,方差为1的标准正态分布 mxn维 随机阵
% randn(m,n,j,k) 产生均值为0,方差为1的标准正态分布 nxnxjxk维 随机阵
% randn(size(A)) 产生均值为0,方差为1的标准正态分布 一个和A有相同维数大小 随机阵

%save保存数据 load加载数据
%{
---》save
正在保存到: e:\Note\matlabnote\matlab.mat
---》load
正在从 E:\Note\matlabnote\matlab.mat 中加载
---》Ya
Ya =

    1.5442    0.0859   -1.4916   -0.7423   -1.0616    2.3505
---》clear
---》Ya
函数或变量 'Ya' 无法识别。
---》load
正在从 E:\Note\matlabnote\matlab.mat 中加载
---》Ya
Ya =
    1.5442    0.0859   -1.4916   -0.7423   -1.0616    2.3505
%}

%--------------------------------------------------------------------------
%   矩阵的拆分
%--------------------------------------------------------------------------