% % function Jerk_Multiscroll_phase
%Jerk的多涡卷相图 

%==================================求特征根，特征方程 开始=========================
% clear;
% close all;
% global a;
% global b;
% global c;
% global d;
% 
% a=0.7;
% b=0.7;
% c=0.7;
% d=0.7;
% % syms d;
% d=0.7;
% A=[0,1,0;0,0,1;-d,-d,-d];
% [V,b]=eig(A);%求特征根和特征值
% lambda=diag(b);
% AA=sym(A);
% BB=poly(AA);%特征多项式
% cc=simple(BB); %化简特征多项式
%==================================求特征根，特征方程  结束=========================
%%=================Jerk系统相图  开始======================
clear;
close all;
% global a;
% global b;
% global c;
% global d;
% global k;
% global h1;
% global h2;
% global h3;
% global h4;
% global h5;
% global h6;
% global h7;
% global h8;
% global h9;
% global h10;
% global d1;

% % global a;
% % global b;
% % global c;
% % global d;
% % global A;
% % global A1;
% % n=1;  %n==0.7---1.4;a=0.49---0.98
% % a = 0.7*n;
% % b = 0.7*n;
% % c = 0.7*n;
% % d = 0.7;
% % A = 2;
% % A1=3;
% A=sqrt(-0.25/0.35);
format long
% a=d*2*k/h1; 
% %-----------------饱和函数 >>>>>---------------------------
% b=0.7;
% c=0.7;
% d=0.7;
% k=8;
% h1=10;%h1=20,k=20涡卷完整，h1=10,k=10,涡卷不完整
% h2=2*h1;
% h3=3*h1;
% h4=4*h1;
% h5=5*h1;
% h6=6*h1;
% h7=7*h1;
% h8=8*h1;
% h9=9*h1;
% h10=10*h1;
% a=d*2*k/h1; 
% %-----------------饱和函数 <<<<<---------------------------
% d1=2;
% a=d*2*k/h1; 
% % a=0.7
% %---------------------------------------
% b=0.7;
% c=0.7;
% d=0.7;
% k=10;
% h1=15;
% h2=2*h1;
% h3=3*h1;
% h4=4*h1;
% a=0.7; 
%----------------------------------
% a=0.7;
% y0=[0 0 0]; %初始状态
% y0=[0.1 0.1 0.1]; %初始状态,输入为sin(x)
% y0=[0.1 0 0]; %初始状态,输入为sin(x)
y0=[1.0 0 0]; %初始状态,输入为sin(x)
%------------------------------------------------------------------------
tspan=0:(1*10^(-3)):400;
[t,y]=ODE45('Jerk_Multiscroll',tspan,y0);
% %-------------------图1--------------------------------
figure(1);
plot3(y(10000:end,1),y(10000:end,2),y(10000:end,3));
% title('a=0.6,b=0.5,c=0.3,d=0.35');
xlabel('x');
ylabel('y');
zlabel('z');

%-------------------图2 x-y 平面--------------------------------
figure(2);
% subplot(1,2);
% plot(y(40000:end,1),y(40000:end,2));
plot(y(10000:20000,1),y(10000:20000,2));
y2=y(10000:20000,2);
y2=y2/1.5+1;
y3=y2*4095/3.3;
fid=fopen('d:\sinedata_y.txt','w');
for r=1:1:length(y3)
fprintf(fid,'%.0f',y3(r));
fprintf(fid,'%s',',');
end
fclose(fid);

y21=y(10000:20000,1);
y21=y21/8+1;
y31=y21*4095/3.3;
fid=fopen('d:\sinedata_x.txt','w');
for r=1:1:length(y31)
fprintf(fid,'%.0f',y31(r));
fprintf(fid,'%s',',');
end
fclose(fid);

% plot(y(10000:end,1),y(10000:end,2));
% title('a=0.6,b=0.5,c=0.3,d=0.35');
% title('a=0.3,c=0.3,b=0.5,n=4,d=0.3');
% hold on;
% plot(y(400000:end,1),y(400000:end,2),'r');
xlabel('x');
ylabel('y');
% 
% % % %-------------------图3  x-z平面--------------------------------
% % % subplot(1,2);
% figure(3);
% plot(y(10000:end,1),y(10000:end,3));
% % title('a=0.6,b=0.5,c=0.3,d=0.35');
% xlabel('x');
% ylabel('z');
% % % %-------------------图4  y-z平面--------------------------------
% % % % subplot(1,2);
% figure(4);
% plot(y(10000:end,2),y(10000:end,3));
% xlabel('y');
% ylabel('z');
% % % %-------------------图5--------4------------------------
figure(5);
plot(t(20000:end),y(20000:end,1));

figure(6);
plot(t(20000:end),y(20000:end,2));
% % xlabel('t');
% % ylabel('x');
% % hold on;
% % plot(y(20000:end,3),'r');
% figure(5);
% plot(t(10000:end),y(10000:end,1));
% xlabel('t');
% ylabel('x');
% %%=================包混沌系统相图  结束======================

%%=========劳斯表计算  开始=================
% clear;
% close all;
% a=20;
% b=20;
% c=40;
% x(1)=1;
% x(2)=(b+c-a);
% x(3)=b*c-a*b;
% x(4)=2*a*b*c;
% figure(1);
% i=1;
% for a=12:20
%   x(2)=(b+c-a);
%   x(3)=b*c-a*b;
%   x(4)=2*a*b*c;
%   y(i,:)=routh(x);
%   if(a==20)
%     plot(y(i,:),'r-');%劳斯表低1列系数
%   else 
%     plot(y(i,:),'b-*');%劳斯表低1列系数
%   end  
%   hold on;
%   i=i+1;
% end
% y1=[0,0,0,0];
% plot(y1,'r-');%绘制取值=0的曲线
%%=========劳斯表计算  结束=================
% % end
